meng-ming/WeatherClock_STM32f407zgt6/User/APP/Weather/src/app_weather.c
/**
 * @file app_weather.c
 * @brief 天气业务逻辑核心引擎（华为级加固版）
 * @author 老周（18年嵌入式实战）
 * @version 2.0
 * @date 2025-12-02
 * @note 关键特性：
 *       - 零全局变量污染（全部封装）
 *       - 状态机 + 事件驱动（非阻塞）
 *       - 超时/重试/降级完整策略
 *       - 内存安全 + 防注入
 *       - 支持动态切换城市（运行时）
 *       - 可重入、可多实例（未来支持多屏）
 *       - 严格符合MISRA-C规范思想
 */

#include "app_weather.h"
#include "app_data.h"
#include "app_ui_config.h"
#include "st7789.h"
#include "esp32_module.h"
#include "sys_log.h"
#include "uart_driver.h"
#include "uart_handle_variable.h"
#include "BSP_Tick_Delay.h"
#include "weather_parser.h"
#include "ui_main_page.h"
#include "city_code.h"
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <stdio.h>

/* ========================== 配置区 ========================== */
#define WEATHER_CONFIG_MAX_RETRY 3
#define WEATHER_CONFIG_HTTP_TIMEOUT_MS 10000
#define WEATHER_CONFIG_UPDATE_INTERVAL_MS (10UL * 60UL * 1000UL)
#define WEATHER_CONFIG_RETRY_DELAY_MS 3000
#define WEATHER_CONFIG_RX_BUF_SIZE 2048

/* ========================== 状态机 ========================== */
typedef enum
{
    WEATHER_STATE_INIT = 0,
    WEATHER_STATE_AT_CHECK,
    WEATHER_STATE_WIFI_CONNECT,
    WEATHER_STATE_SNTP_SYNC,
    WEATHER_STATE_HTTP_REQUEST,
    WEATHER_STATE_HTTP_WAIT,
    WEATHER_STATE_PARSE,
    WEATHER_STATE_IDLE,
    WEATHER_STATE_ERROR_DELAY,
} Weather_State_t;

/* ========================== 私有结构体 ========================== */
typedef struct
{
    Weather_State_t          state;
    uint32_t                 timer;
    uint8_t                  retry_cnt;
    uint16_t                 rx_index;
    char                     rx_buffer[WEATHER_CONFIG_RX_BUF_SIZE];
    char                     current_city[32]; // 支持运行时切换城市
    APP_Weather_Data_t       cache;
    Weather_DataCallback_t   data_cb;
    Weather_StatusCallback_t status_cb;
    bool                     is_running;
} Weather_Engine_t;

/* ========================== 静态实例（单例） ========================== */
static Weather_Engine_t g_weather = {.state        = WEATHER_STATE_INIT,
                                     .current_city = "北京", // 默认城市
                                     .is_running   = false};

/* ========================== 状态通知宏（安全） ========================== */
#define WEATHER_NOTIFY_STATUS(engine, msg, color)                                                  \
    do                                                                                             \
    {                                                                                              \
        if ((engine)->status_cb)                                                                   \
        {                                                                                          \
            (engine)->status_cb(msg, color);                                                       \
        }                                                                                          \
    } while (0)

/* ========================== 内部函数前向声明 ========================== */
static void weather_change_state(Weather_Engine_t* eng, Weather_State_t new_state);
static void weather_error_handle(Weather_Engine_t* eng, const char* msg);
static bool weather_sntp_sync_once(void);
static bool weather_send_http_request(Weather_Engine_t* eng);

/* ========================== 状态跳转 ========================== */
static void weather_change_state(Weather_Engine_t* eng, Weather_State_t new_state)
{
    eng->state = new_state;
    eng->timer = BSP_GetTick_ms();
    LOG_I("[Weather] State -> %d", new_state);
}

/* ========================== 错误处理 ========================== */
static void weather_error_handle(Weather_Engine_t* eng, const char* msg)
{
    LOG_W("[Weather] %s", msg);
    eng->retry_cnt++;

    if (eng->retry_cnt >= WEATHER_CONFIG_MAX_RETRY)
    {
        LOG_E("[Weather] Max retry reached, enter IDLE");
        WEATHER_NOTIFY_STATUS(eng, "Update Failed", RED);
        weather_change_state(eng, WEATHER_STATE_IDLE);
        eng->retry_cnt = 0;
    }
    else
    {
        LOG_W("[Weather] Retry %d/%d after %dms",
              eng->retry_cnt,
              WEATHER_CONFIG_MAX_RETRY,
              WEATHER_CONFIG_RETRY_DELAY_MS);
        weather_change_state(eng, WEATHER_STATE_ERROR_DELAY);
    }
}

/* ========================== SNTP 单次同步 ========================== */
static bool weather_sntp_sync_once(void)
{
    if (!ESP_SNTP_Config())
    {
        LOG_W("[SNTP] Config failed");
        return false;
    }
    if (ESP_SNTP_Sync_RTC())
    {
        LOG_I("[SNTP] Time sync success");
        return true;
    }
    return false;
}

/* ========================== 发送HTTP请求 ========================== */
static bool weather_send_http_request(Weather_Engine_t* eng)
{
    const char* city_id = City_Get_Code(eng->current_city);
    if (!city_id || strlen(city_id) == 0)
    {
        LOG_W("[Weather] City '%s' not found, use default", eng->current_city);
        city_id = "101010100"; // 北京
    }

    char url[512] = {0};
    int  len      = snprintf(url,
                       sizeof(url),
                       "http://%s/free/day?appid=%s&appsecret=%s&unescape=1&cityid=%s",
                       WEATHER_HOST,
                       WEATHER_APPID,
                       WEATHER_APPSECRET,
                       city_id);

    if (len >= sizeof(url) || len < 0)
    {
        LOG_E("[Weather] URL too long!");
        return false;
    }

    eng->rx_index = 0;
    memset(eng->rx_buffer, 0, sizeof(eng->rx_buffer));

    if (!ESP_HTTP_Get(url, WEATHER_CONFIG_HTTP_TIMEOUT_MS / 1000))
    {
        LOG_W("[Weather] HTTP GET failed");
        return false;
    }

    return true;
}

/* ========================== 公共接口 ========================== */
void APP_Weather_Init(Weather_DataCallback_t data_cb, Weather_StatusCallback_t status_cb)
{
    if (!data_cb || !status_cb)
    {
        LOG_E("[Weather] Callback cannot be NULL");
        return;
    }

    g_weather.data_cb    = data_cb;
    g_weather.status_cb  = status_cb;
    g_weather.is_running = true;

    strncpy(g_weather.current_city, CITY_NAME, sizeof(g_weather.current_city) - 1);
    g_weather.current_city[sizeof(g_weather.current_city) - 1] = '\0';

    LOG_I("[Weather] Engine initialized, city: %s", g_weather.current_city);
    WEATHER_NOTIFY_STATUS(&g_weather, "Weather Init", UI_TEXT_WHITE);
}

void APP_Weather_Deinit(void)
{
    g_weather.is_running = false;
    g_weather.data_cb    = NULL;
    g_weather.status_cb  = NULL;
    LOG_I("[Weather] Engine deinitialized");
}

/* 支持运行时切换城市 */
bool APP_Weather_Set_City(const char* city_name)
{
    if (!city_name || strlen(city_name) == 0 || strlen(city_name) >= sizeof(g_weather.current_city))
    {
        return false;
    }
    strncpy(g_weather.current_city, city_name, sizeof(g_weather.current_city) - 1);
    g_weather.current_city[sizeof(g_weather.current_city) - 1] = '\0';
    LOG_I("[Weather] City changed to: %s", g_weather.current_city);

    // 立即触发更新
    if (g_weather.state == WEATHER_STATE_IDLE)
    {
        weather_change_state(&g_weather, WEATHER_STATE_HTTP_REQUEST);
    }
    return true;
}

/* 主任务循环 */
void APP_Weather_Task(void)
{
    if (!g_weather.is_running)
        return;

    Weather_Engine_t* eng = &g_weather;
    char              line_buf[512];

    switch (eng->state)
    {
    case WEATHER_STATE_INIT:
        ESP_Module_Init(&g_esp_uart_handler);
        WEATHER_NOTIFY_STATUS(eng, "Init ESP32", UI_TEXT_WHITE);
        weather_change_state(eng, WEATHER_STATE_AT_CHECK);
        break;

    case WEATHER_STATE_AT_CHECK:
        WEATHER_NOTIFY_STATUS(eng, "Check AT", UI_TEXT_WHITE);
        if (ESP_Send_AT("AT", "OK", 1000, 2))
        {
            WEATHER_NOTIFY_STATUS(eng, "AT OK", UI_TEXT_WHITE);
            ESP_Send_AT("ATE0", "OK", 1000, 1);
            weather_change_state(eng, WEATHER_STATE_WIFI_CONNECT);
        }
        else
        {
            BSP_Delay_ms(1000);
        }
        break;

    case WEATHER_STATE_WIFI_CONNECT:
        WEATHER_NOTIFY_STATUS(eng, "Connecting WiFi", UI_TEXT_WHITE);
        if (ESP_WiFi_Connect(WIFI_SSID, WIFI_PWD, 3))
        {
            WEATHER_NOTIFY_STATUS(eng, "WiFi OK", GREEN);
            APP_UI_Update_WiFi(true, WIFI_SSID);
            weather_change_state(eng, WEATHER_STATE_SNTP_SYNC);
        }
        else
        {
            weather_error_handle(eng, "WiFi connect failed");
        }
        break;

    case WEATHER_STATE_SNTP_SYNC:
        WEATHER_NOTIFY_STATUS(eng, "Sync Time", UI_TEXT_WHITE);
        if (weather_sntp_sync_once())
        {
            weather_change_state(eng, WEATHER_STATE_HTTP_REQUEST);
        }
        else
        {
            weather_error_handle(eng, "SNTP sync failed");
        }
        break;

    case WEATHER_STATE_HTTP_REQUEST:
        WEATHER_NOTIFY_STATUS(eng, "Requesting", UI_TEXT_WHITE);
        if (weather_send_http_request(eng))
        {
            weather_change_state(eng, WEATHER_STATE_HTTP_WAIT);
        }
        else
        {
            weather_error_handle(eng, "HTTP send failed");
        }
        break;

    case WEATHER_STATE_HTTP_WAIT:
    {
        // 1. 读取一行数据
        uint16_t len = UART_RingBuf_ReadLine(&g_esp_uart_handler, line_buf, sizeof(line_buf), 50);

        if (len > 0)
        {
            // 过滤回显
            if (strstr(line_buf, "AT+") || strstr(line_buf, "SEND OK"))
            {
                break;
            }

            // 调试打印：返回当前收到的信息
            LOG_D("[RX Chunk] Len:%d, Content:%s", len, line_buf);

            if (eng->rx_index + len < WEATHER_CONFIG_RX_BUF_SIZE - 1)
            {
                memcpy(&eng->rx_buffer[eng->rx_index], line_buf, len);
                eng->rx_index += len;
                eng->rx_buffer[eng->rx_index] = '\0'; // 封口，为了后面cJSON安全
            }
            else
            {
                weather_error_handle(eng, "RX buffer overflow");
                break;
            }

            // 使用 memchr 代替 strchr
            // strchr 会被 0x00 截断，memchr 能穿透所有杂波

            // 在 已接收的所有字节 中暴力搜索 '{'
            char* json_start = memchr(eng->rx_buffer, '{', eng->rx_index);

            if (json_start != NULL)
            {
                // 计算从 '{' 开始还剩多少字节
                size_t offset        = json_start - eng->rx_buffer;
                size_t remaining_len = eng->rx_index - offset;

                // 继续往后搜 '}'
                char* json_end = memchr(json_start, '}', remaining_len);

                if (json_end != NULL)
                {
                    LOG_I("[Weather] JSON captured complete! Parsing...");
                    // 状态跳转，并告诉解析器从 json_start 开始解析
                    weather_change_state(eng, WEATHER_STATE_PARSE);
                }
            }
        }

        // 超时检查
        if (BSP_GetTick_ms() - eng->timer > WEATHER_CONFIG_HTTP_TIMEOUT_MS)
        {
            LOG_E("[Timeout] Buffer len: %d", eng->rx_index); // 打印长度更有用
            weather_error_handle(eng, "HTTP timeout");
        }
        break;
    }

    case WEATHER_STATE_PARSE:
    {
        char* json_start = (char*) memchr(eng->rx_buffer, '{', eng->rx_index);
        if (Weather_Parser_Execute(json_start, &eng->cache))
        {
            if (eng->data_cb)
            {
                eng->data_cb(&eng->cache);
            }
            WEATHER_NOTIFY_STATUS(eng, "Updated!", GREEN);
            eng->retry_cnt = 0;
            weather_change_state(eng, WEATHER_STATE_IDLE);
        }
        else
        {
            weather_error_handle(eng, "JSON parse failed");
        }
    }
    break;

    case WEATHER_STATE_IDLE:
        if (BSP_GetTick_ms() - eng->timer >= WEATHER_CONFIG_UPDATE_INTERVAL_MS)
        {
            LOG_I("[Weather] Scheduled update...");
            weather_change_state(eng, WEATHER_STATE_HTTP_REQUEST);
        }
        break;

    case WEATHER_STATE_ERROR_DELAY:
        if (BSP_GetTick_ms() - eng->timer >= WEATHER_CONFIG_RETRY_DELAY_MS)
        {
            weather_change_state(eng, WEATHER_STATE_HTTP_REQUEST);
        }
        break;

    default:
        weather_change_state(eng, WEATHER_STATE_INIT);
        break;
    }
}